Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/mjpeg_reg.h
/* 0x44 : mjpeg_Y_frame_read_status_2 */
#define MJPEG_Y_FRAME_READ_STATUS_2_OFFSET (0x44)
#define MJPEG_YY_WBLK_R                    MJPEG_YY_WBLK_R
#define MJPEG_YY_WBLK_R_POS                (0U)
#define MJPEG_YY_WBLK_R_LEN                (13U)
#define MJPEG_YY_WBLK_R_MSK                (((1U << MJPEG_YY_WBLK_R_LEN) - 1) << MJPEG_YY_WBLK_R_POS)
#define MJPEG_YY_WBLK_R_UMSK               (~(((1U << MJPEG_YY_WBLK_R_LEN) - 1) << MJPEG_YY_WBLK_R_POS))
#define MJPEG_YY_MEM_RND_R                 MJPEG_YY_MEM_RND_R
#define MJPEG_YY_MEM_RND_R_POS             (16U)
#define MJPEG_YY_MEM_RND_R_LEN             (8U)
#define MJPEG_YY_MEM_RND_R_MSK             (((1U << MJPEG_YY_MEM_RND_R_LEN) - 1) << MJPEG_YY_MEM_RND_R_POS)
#define MJPEG_YY_MEM_RND_R_UMSK            (~(((1U << MJPEG_YY_MEM_RND_R_LEN) - 1) << MJPEG_YY_MEM_RND_R_POS))
#define MJPEG_YY_FRM_CNT_R                 MJPEG_YY_FRM_CNT_R
#define MJPEG_YY_FRM_CNT_R_POS             (24U)
#define MJPEG_YY_FRM_CNT_R_LEN             (8U)
#define MJPEG_YY_FRM_CNT_R_MSK             (((1U << MJPEG_YY_FRM_CNT_R_LEN) - 1) << MJPEG_YY_FRM_CNT_R_POS)
#define MJPEG_YY_FRM_CNT_R_UMSK            (~(((1U << MJPEG_YY_FRM_CNT_R_LEN) - 1) << MJPEG_YY_FRM_CNT_R_POS))

/* 0x48 : mjpeg_Y_frame_write_status */
#define MJPEG_Y_FRAME_WRITE_STATUS_OFFSET (0x48)
#define MJPEG_YY_MEM_HBLK_W               MJPEG_YY_MEM_HBLK_W
#define MJPEG_YY_MEM_HBLK_W_POS           (0U)
#define MJPEG_YY_MEM_HBLK_W_LEN           (13U)
#define MJPEG_YY_MEM_HBLK_W_MSK           (((1U << MJPEG_YY_MEM_HBLK_W_LEN) - 1) << MJPEG_YY_MEM_HBLK_W_POS)
#define MJPEG_YY_MEM_HBLK_W_UMSK          (~(((1U << MJPEG_YY_MEM_HBLK_W_LEN) - 1) << MJPEG_YY_MEM_HBLK_W_POS))
#define MJPEG_YY_MEM_RND_W                MJPEG_YY_MEM_RND_W
#define MJPEG_YY_MEM_RND_W_POS            (16U)
#define MJPEG_YY_MEM_RND_W_LEN            (8U)
#define MJPEG_YY_MEM_RND_W_MSK            (((1U << MJPEG_YY_MEM_RND_W_LEN) - 1) << MJPEG_YY_MEM_RND_W_POS)
#define MJPEG_YY_MEM_RND_W_UMSK           (~(((1U << MJPEG_YY_MEM_RND_W_LEN) - 1) << MJPEG_YY_MEM_RND_W_POS))
#define MJPEG_YY_FRM_CNT_W                MJPEG_YY_FRM_CNT_W
#define MJPEG_YY_FRM_CNT_W_POS            (24U)
#define MJPEG_YY_FRM_CNT_W_LEN            (8U)
#define MJPEG_YY_FRM_CNT_W_MSK            (((1U << MJPEG_YY_FRM_CNT_W_LEN) - 1) << MJPEG_YY_FRM_CNT_W_POS)
#define MJPEG_YY_FRM_CNT_W_UMSK           (~(((1U << MJPEG_YY_FRM_CNT_W_LEN) - 1) << MJPEG_YY_FRM_CNT_W_POS))

/* 0x4C : mjpeg_UV_frame_read_status_1 */
#define MJPEG_UV_FRAME_READ_STATUS_1_OFFSET (0x4C)
#define MJPEG_UV_MEM_HBLK_R                 MJPEG_UV_MEM_HBLK_R
#define MJPEG_UV_MEM_HBLK_R_POS             (0U)
#define MJPEG_UV_MEM_HBLK_R_LEN             (13U)
#define MJPEG_UV_MEM_HBLK_R_MSK             (((1U << MJPEG_UV_MEM_HBLK_R_LEN) - 1) << MJPEG_UV_MEM_HBLK_R_POS)
#define MJPEG_UV_MEM_HBLK_R_UMSK            (~(((1U << MJPEG_UV_MEM_HBLK_R_LEN) - 1) << MJPEG_UV_MEM_HBLK_R_POS))
#define MJPEG_UV_FRM_HBLK_R                 MJPEG_UV_FRM_HBLK_R
#define MJPEG_UV_FRM_HBLK_R_POS             (16U)
#define MJPEG_UV_FRM_HBLK_R_LEN             (13U)
#define MJPEG_UV_FRM_HBLK_R_MSK             (((1U << MJPEG_UV_FRM_HBLK_R_LEN) - 1) << MJPEG_UV_FRM_HBLK_R_POS)
#define MJPEG_UV_FRM_HBLK_R_UMSK            (~(((1U << MJPEG_UV_FRM_HBLK_R_LEN) - 1) << MJPEG_UV_FRM_HBLK_R_POS))

/* 0x50 : mjpeg_UV_frame_read_status_2 */
#define MJPEG_UV_FRAME_READ_STATUS_2_OFFSET (0x50)
#define MJPEG_UV_WBLK_R                     MJPEG_UV_WBLK_R
#define MJPEG_UV_WBLK_R_POS                 (0U)
#define MJPEG_UV_WBLK_R_LEN                 (13U)
#define MJPEG_UV_WBLK_R_MSK                 (((1U << MJPEG_UV_WBLK_R_LEN) - 1) << MJPEG_UV_WBLK_R_POS)
#define MJPEG_UV_WBLK_R_UMSK                (~(((1U << MJPEG_UV_WBLK_R_LEN) - 1) << MJPEG_UV_WBLK_R_POS))
#define MJPEG_UV_MEM_RND_R                  MJPEG_UV_MEM_RND_R
#define MJPEG_UV_MEM_RND_R_POS              (16U)
#define MJPEG_UV_MEM_RND_R_LEN              (8U)
#define MJPEG_UV_MEM_RND_R_MSK              (((1U << MJPEG_UV_MEM_RND_R_LEN) - 1) << MJPEG_UV_MEM_RND_R_POS)
#define MJPEG_UV_MEM_RND_R_UMSK             (~(((1U << MJPEG_UV_MEM_RND_R_LEN) - 1) << MJPEG_UV_MEM_RND_R_POS))
#define MJPEG_UV_FRM_CNT_R                  MJPEG_UV_FRM_CNT_R
#define MJPEG_UV_FRM_CNT_R_POS              (24U)
#define MJPEG_UV_FRM_CNT_R_LEN              (8U)
#define MJPEG_UV_FRM_CNT_R_MSK              (((1U << MJPEG_UV_FRM_CNT_R_LEN) - 1) << MJPEG_UV_FRM_CNT_R_POS)
#define MJPEG_UV_FRM_CNT_R_UMSK             (~(((1U << MJPEG_UV_FRM_CNT_R_LEN) - 1) << MJPEG_UV_FRM_CNT_R_POS))

/* 0x54 : mjpeg_UV_frame_write_status */
#define MJPEG_UV_FRAME_WRITE_STATUS_OFFSET (0x54)
#define MJPEG_UV_MEM_HBLK_W                MJPEG_UV_MEM_HBLK_W
#define MJPEG_UV_MEM_HBLK_W_POS            (0U)
#define MJPEG_UV_MEM_HBLK_W_LEN            (13U)
#define MJPEG_UV_MEM_HBLK_W_MSK            (((1U << MJPEG_UV_MEM_HBLK_W_LEN) - 1) << MJPEG_UV_MEM_HBLK_W_POS)
#define MJPEG_UV_MEM_HBLK_W_UMSK           (~(((1U << MJPEG_UV_MEM_HBLK_W_LEN) - 1) << MJPEG_UV_MEM_HBLK_W_POS))
#define MJPEG_UV_MEM_RND_W                 MJPEG_UV_MEM_RND_W
#define MJPEG_UV_MEM_RND_W_POS             (16U)
#define MJPEG_UV_MEM_RND_W_LEN             (8U)
#define MJPEG_UV_MEM_RND_W_MSK             (((1U << MJPEG_UV_MEM_RND_W_LEN) - 1) << MJPEG_UV_MEM_RND_W_POS)
#define MJPEG_UV_MEM_RND_W_UMSK            (~(((1U << MJPEG_UV_MEM_RND_W_LEN) - 1) << MJPEG_UV_MEM_RND_W_POS))
#define MJPEG_UV_FRM_CNT_W                 MJPEG_UV_FRM_CNT_W
#define MJPEG_UV_FRM_CNT_W_POS             (24U)
#define MJPEG_UV_FRM_CNT_W_LEN             (8U)
#define MJPEG_UV_FRM_CNT_W_MSK             (((1U << MJPEG_UV_FRM_CNT_W_LEN) - 1) << MJPEG_UV_FRM_CNT_W_POS)
#define MJPEG_UV_FRM_CNT_W_UMSK            (~(((1U << MJPEG_UV_FRM_CNT_W_LEN) - 1) << MJPEG_UV_FRM_CNT_W_POS))

/* 0x80 : mjpeg_start_addr0 */
#define MJPEG_START_ADDR0_OFFSET      (0x80)
#define MJPEG_FRAME_START_ADDR_0      MJPEG_FRAME_START_ADDR_0
#define MJPEG_FRAME_START_ADDR_0_POS  (0U)
#define MJPEG_FRAME_START_ADDR_0_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_0_MSK  (((1U << MJPEG_FRAME_START_ADDR_0_LEN) - 1) << MJPEG_FRAME_START_ADDR_0_POS)
#define MJPEG_FRAME_START_ADDR_0_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_0_LEN) - 1) << MJPEG_FRAME_START_ADDR_0_POS))

/* 0x84 : mjpeg_bit_cnt0 */
#define MJPEG_BIT_CNT0_OFFSET      (0x84)
#define MJPEG_FRAME_BIT_CNT_0      MJPEG_FRAME_BIT_CNT_0
#define MJPEG_FRAME_BIT_CNT_0_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_0_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_0_MSK  (((1U << MJPEG_FRAME_BIT_CNT_0_LEN) - 1) << MJPEG_FRAME_BIT_CNT_0_POS)
#define MJPEG_FRAME_BIT_CNT_0_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_0_LEN) - 1) << MJPEG_FRAME_BIT_CNT_0_POS))

