Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/mjpeg_reg.h
/* 0xC0 : mjpeg_start_addr_8 */
#define MJPEG_START_ADDR_8_OFFSET     (0xC0)
#define MJPEG_FRAME_START_ADDR_8      MJPEG_FRAME_START_ADDR_8
#define MJPEG_FRAME_START_ADDR_8_POS  (0U)
#define MJPEG_FRAME_START_ADDR_8_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_8_MSK  (((1U << MJPEG_FRAME_START_ADDR_8_LEN) - 1) << MJPEG_FRAME_START_ADDR_8_POS)
#define MJPEG_FRAME_START_ADDR_8_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_8_LEN) - 1) << MJPEG_FRAME_START_ADDR_8_POS))

/* 0xC4 : mjpeg_bit_cnt_8 */
#define MJPEG_BIT_CNT_8_OFFSET     (0xC4)
#define MJPEG_FRAME_BIT_CNT_8      MJPEG_FRAME_BIT_CNT_8
#define MJPEG_FRAME_BIT_CNT_8_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_8_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_8_MSK  (((1U << MJPEG_FRAME_BIT_CNT_8_LEN) - 1) << MJPEG_FRAME_BIT_CNT_8_POS)
#define MJPEG_FRAME_BIT_CNT_8_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_8_LEN) - 1) << MJPEG_FRAME_BIT_CNT_8_POS))

/* 0xC8 : mjpeg_start_addr_9 */
#define MJPEG_START_ADDR_9_OFFSET     (0xC8)
#define MJPEG_FRAME_START_ADDR_9      MJPEG_FRAME_START_ADDR_9
#define MJPEG_FRAME_START_ADDR_9_POS  (0U)
#define MJPEG_FRAME_START_ADDR_9_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_9_MSK  (((1U << MJPEG_FRAME_START_ADDR_9_LEN) - 1) << MJPEG_FRAME_START_ADDR_9_POS)
#define MJPEG_FRAME_START_ADDR_9_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_9_LEN) - 1) << MJPEG_FRAME_START_ADDR_9_POS))

/* 0xCC : mjpeg_bit_cnt_9 */
#define MJPEG_BIT_CNT_9_OFFSET     (0xCC)
#define MJPEG_FRAME_BIT_CNT_9      MJPEG_FRAME_BIT_CNT_9
#define MJPEG_FRAME_BIT_CNT_9_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_9_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_9_MSK  (((1U << MJPEG_FRAME_BIT_CNT_9_LEN) - 1) << MJPEG_FRAME_BIT_CNT_9_POS)
#define MJPEG_FRAME_BIT_CNT_9_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_9_LEN) - 1) << MJPEG_FRAME_BIT_CNT_9_POS))

/* 0xD0 : mjpeg_start_addr_a */
#define MJPEG_START_ADDR_A_OFFSET     (0xD0)
#define MJPEG_FRAME_START_ADDR_A      MJPEG_FRAME_START_ADDR_A
#define MJPEG_FRAME_START_ADDR_A_POS  (0U)
#define MJPEG_FRAME_START_ADDR_A_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_A_MSK  (((1U << MJPEG_FRAME_START_ADDR_A_LEN) - 1) << MJPEG_FRAME_START_ADDR_A_POS)
#define MJPEG_FRAME_START_ADDR_A_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_A_LEN) - 1) << MJPEG_FRAME_START_ADDR_A_POS))

/* 0xD4 : mjpeg_bit_cnt_a */
#define MJPEG_BIT_CNT_A_OFFSET     (0xD4)
#define MJPEG_FRAME_BIT_CNT_A      MJPEG_FRAME_BIT_CNT_A
#define MJPEG_FRAME_BIT_CNT_A_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_A_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_A_MSK  (((1U << MJPEG_FRAME_BIT_CNT_A_LEN) - 1) << MJPEG_FRAME_BIT_CNT_A_POS)
#define MJPEG_FRAME_BIT_CNT_A_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_A_LEN) - 1) << MJPEG_FRAME_BIT_CNT_A_POS))

/* 0xD8 : mjpeg_start_addr_b */
#define MJPEG_START_ADDR_B_OFFSET     (0xD8)
#define MJPEG_FRAME_START_ADDR_B      MJPEG_FRAME_START_ADDR_B
#define MJPEG_FRAME_START_ADDR_B_POS  (0U)
#define MJPEG_FRAME_START_ADDR_B_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_B_MSK  (((1U << MJPEG_FRAME_START_ADDR_B_LEN) - 1) << MJPEG_FRAME_START_ADDR_B_POS)
#define MJPEG_FRAME_START_ADDR_B_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_B_LEN) - 1) << MJPEG_FRAME_START_ADDR_B_POS))

/* 0xDC : mjpeg_bit_cnt_b */
#define MJPEG_BIT_CNT_B_OFFSET     (0xDC)
#define MJPEG_FRAME_BIT_CNT_B      MJPEG_FRAME_BIT_CNT_B
#define MJPEG_FRAME_BIT_CNT_B_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_B_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_B_MSK  (((1U << MJPEG_FRAME_BIT_CNT_B_LEN) - 1) << MJPEG_FRAME_BIT_CNT_B_POS)
#define MJPEG_FRAME_BIT_CNT_B_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_B_LEN) - 1) << MJPEG_FRAME_BIT_CNT_B_POS))

/* 0xE0 : mjpeg_start_addr_c */
#define MJPEG_START_ADDR_C_OFFSET     (0xE0)
#define MJPEG_FRAME_START_ADDR_C      MJPEG_FRAME_START_ADDR_C
#define MJPEG_FRAME_START_ADDR_C_POS  (0U)
#define MJPEG_FRAME_START_ADDR_C_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_C_MSK  (((1U << MJPEG_FRAME_START_ADDR_C_LEN) - 1) << MJPEG_FRAME_START_ADDR_C_POS)
#define MJPEG_FRAME_START_ADDR_C_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_C_LEN) - 1) << MJPEG_FRAME_START_ADDR_C_POS))

/* 0xE4 : mjpeg_bit_cnt_c */
#define MJPEG_BIT_CNT_C_OFFSET     (0xE4)
#define MJPEG_FRAME_BIT_CNT_C      MJPEG_FRAME_BIT_CNT_C
#define MJPEG_FRAME_BIT_CNT_C_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_C_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_C_MSK  (((1U << MJPEG_FRAME_BIT_CNT_C_LEN) - 1) << MJPEG_FRAME_BIT_CNT_C_POS)
#define MJPEG_FRAME_BIT_CNT_C_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_C_LEN) - 1) << MJPEG_FRAME_BIT_CNT_C_POS))

/* 0xE8 : mjpeg_start_addr_d */
#define MJPEG_START_ADDR_D_OFFSET     (0xE8)
#define MJPEG_FRAME_START_ADDR_D      MJPEG_FRAME_START_ADDR_D
#define MJPEG_FRAME_START_ADDR_D_POS  (0U)
#define MJPEG_FRAME_START_ADDR_D_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_D_MSK  (((1U << MJPEG_FRAME_START_ADDR_D_LEN) - 1) << MJPEG_FRAME_START_ADDR_D_POS)
#define MJPEG_FRAME_START_ADDR_D_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_D_LEN) - 1) << MJPEG_FRAME_START_ADDR_D_POS))

/* 0xEC : mjpeg_bit_cnt_d */
#define MJPEG_BIT_CNT_D_OFFSET     (0xEC)
#define MJPEG_FRAME_BIT_CNT_D      MJPEG_FRAME_BIT_CNT_D
#define MJPEG_FRAME_BIT_CNT_D_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_D_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_D_MSK  (((1U << MJPEG_FRAME_BIT_CNT_D_LEN) - 1) << MJPEG_FRAME_BIT_CNT_D_POS)
#define MJPEG_FRAME_BIT_CNT_D_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_D_LEN) - 1) << MJPEG_FRAME_BIT_CNT_D_POS))

/* 0xF0 : mjpeg_start_addr_e */
#define MJPEG_START_ADDR_E_OFFSET     (0xF0)
#define MJPEG_FRAME_START_ADDR_E      MJPEG_FRAME_START_ADDR_E
#define MJPEG_FRAME_START_ADDR_E_POS  (0U)
#define MJPEG_FRAME_START_ADDR_E_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_E_MSK  (((1U << MJPEG_FRAME_START_ADDR_E_LEN) - 1) << MJPEG_FRAME_START_ADDR_E_POS)
#define MJPEG_FRAME_START_ADDR_E_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_E_LEN) - 1) << MJPEG_FRAME_START_ADDR_E_POS))

/* 0xF4 : mjpeg_bit_cnt_e */
#define MJPEG_BIT_CNT_E_OFFSET     (0xF4)
#define MJPEG_FRAME_BIT_CNT_E      MJPEG_FRAME_BIT_CNT_E
#define MJPEG_FRAME_BIT_CNT_E_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_E_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_E_MSK  (((1U << MJPEG_FRAME_BIT_CNT_E_LEN) - 1) << MJPEG_FRAME_BIT_CNT_E_POS)
#define MJPEG_FRAME_BIT_CNT_E_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_E_LEN) - 1) << MJPEG_FRAME_BIT_CNT_E_POS))

/* 0xF8 : mjpeg_start_addr_f */
#define MJPEG_START_ADDR_F_OFFSET     (0xF8)
#define MJPEG_FRAME_START_ADDR_F      MJPEG_FRAME_START_ADDR_F
#define MJPEG_FRAME_START_ADDR_F_POS  (0U)
#define MJPEG_FRAME_START_ADDR_F_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_F_MSK  (((1U << MJPEG_FRAME_START_ADDR_F_LEN) - 1) << MJPEG_FRAME_START_ADDR_F_POS)
#define MJPEG_FRAME_START_ADDR_F_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_F_LEN) - 1) << MJPEG_FRAME_START_ADDR_F_POS))

/* 0xFC : mjpeg_bit_cnt_f */
#define MJPEG_BIT_CNT_F_OFFSET     (0xFC)
#define MJPEG_FRAME_BIT_CNT_F      MJPEG_FRAME_BIT_CNT_F
#define MJPEG_FRAME_BIT_CNT_F_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_F_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_F_MSK  (((1U << MJPEG_FRAME_BIT_CNT_F_LEN) - 1) << MJPEG_FRAME_BIT_CNT_F_POS)
#define MJPEG_FRAME_BIT_CNT_F_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_F_LEN) - 1) << MJPEG_FRAME_BIT_CNT_F_POS))

/* 0x100 : mjpeg_q_mode0 */
#define MJPEG_Q_MODE0_OFFSET      (0x100)
#define MJPEG_FRAME_Q_MODE_0      MJPEG_FRAME_Q_MODE_0
#define MJPEG_FRAME_Q_MODE_0_POS  (0U)
#define MJPEG_FRAME_Q_MODE_0_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_0_MSK  (((1U << MJPEG_FRAME_Q_MODE_0_LEN) - 1) << MJPEG_FRAME_Q_MODE_0_POS)
#define MJPEG_FRAME_Q_MODE_0_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_0_LEN) - 1) << MJPEG_FRAME_Q_MODE_0_POS))

/* 0x104 : mjpeg_q_mode1 */
#define MJPEG_Q_MODE1_OFFSET      (0x104)
#define MJPEG_FRAME_Q_MODE_1      MJPEG_FRAME_Q_MODE_1
#define MJPEG_FRAME_Q_MODE_1_POS  (0U)
#define MJPEG_FRAME_Q_MODE_1_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_1_MSK  (((1U << MJPEG_FRAME_Q_MODE_1_LEN) - 1) << MJPEG_FRAME_Q_MODE_1_POS)
#define MJPEG_FRAME_Q_MODE_1_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_1_LEN) - 1) << MJPEG_FRAME_Q_MODE_1_POS))

/* 0x108 : mjpeg_q_mode2 */
#define MJPEG_Q_MODE2_OFFSET      (0x108)
#define MJPEG_FRAME_Q_MODE_2      MJPEG_FRAME_Q_MODE_2
#define MJPEG_FRAME_Q_MODE_2_POS  (0U)
#define MJPEG_FRAME_Q_MODE_2_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_2_MSK  (((1U << MJPEG_FRAME_Q_MODE_2_LEN) - 1) << MJPEG_FRAME_Q_MODE_2_POS)
#define MJPEG_FRAME_Q_MODE_2_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_2_LEN) - 1) << MJPEG_FRAME_Q_MODE_2_POS))

/* 0x10C : mjpeg_q_mode3 */
#define MJPEG_Q_MODE3_OFFSET      (0x10C)
#define MJPEG_FRAME_Q_MODE_3      MJPEG_FRAME_Q_MODE_3
#define MJPEG_FRAME_Q_MODE_3_POS  (0U)
#define MJPEG_FRAME_Q_MODE_3_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_3_MSK  (((1U << MJPEG_FRAME_Q_MODE_3_LEN) - 1) << MJPEG_FRAME_Q_MODE_3_POS)
#define MJPEG_FRAME_Q_MODE_3_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_3_LEN) - 1) << MJPEG_FRAME_Q_MODE_3_POS))

/* 0x110 : mjpeg_q_mode4 */
#define MJPEG_Q_MODE4_OFFSET      (0x110)
#define MJPEG_FRAME_Q_MODE_4      MJPEG_FRAME_Q_MODE_4
#define MJPEG_FRAME_Q_MODE_4_POS  (0U)
#define MJPEG_FRAME_Q_MODE_4_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_4_MSK  (((1U << MJPEG_FRAME_Q_MODE_4_LEN) - 1) << MJPEG_FRAME_Q_MODE_4_POS)
#define MJPEG_FRAME_Q_MODE_4_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_4_LEN) - 1) << MJPEG_FRAME_Q_MODE_4_POS))

/* 0x114 : mjpeg_q_mode5 */
#define MJPEG_Q_MODE5_OFFSET      (0x114)
#define MJPEG_FRAME_Q_MODE_5      MJPEG_FRAME_Q_MODE_5
#define MJPEG_FRAME_Q_MODE_5_POS  (0U)
#define MJPEG_FRAME_Q_MODE_5_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_5_MSK  (((1U << MJPEG_FRAME_Q_MODE_5_LEN) - 1) << MJPEG_FRAME_Q_MODE_5_POS)
#define MJPEG_FRAME_Q_MODE_5_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_5_LEN) - 1) << MJPEG_FRAME_Q_MODE_5_POS))

/* 0x118 : mjpeg_q_mode6 */
#define MJPEG_Q_MODE6_OFFSET      (0x118)
#define MJPEG_FRAME_Q_MODE_6      MJPEG_FRAME_Q_MODE_6
#define MJPEG_FRAME_Q_MODE_6_POS  (0U)
#define MJPEG_FRAME_Q_MODE_6_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_6_MSK  (((1U << MJPEG_FRAME_Q_MODE_6_LEN) - 1) << MJPEG_FRAME_Q_MODE_6_POS)
#define MJPEG_FRAME_Q_MODE_6_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_6_LEN) - 1) << MJPEG_FRAME_Q_MODE_6_POS))

/* 0x11C : mjpeg_q_mode7 */
#define MJPEG_Q_MODE7_OFFSET      (0x11C)
#define MJPEG_FRAME_Q_MODE_7      MJPEG_FRAME_Q_MODE_7
#define MJPEG_FRAME_Q_MODE_7_POS  (0U)
#define MJPEG_FRAME_Q_MODE_7_LEN  (7U)
#define MJPEG_FRAME_Q_MODE_7_MSK  (((1U << MJPEG_FRAME_Q_MODE_7_LEN) - 1) << MJPEG_FRAME_Q_MODE_7_POS)
#define MJPEG_FRAME_Q_MODE_7_UMSK (~(((1U << MJPEG_FRAME_Q_MODE_7_LEN) - 1) << MJPEG_FRAME_Q_MODE_7_POS))

