Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/mjpeg_reg.h
    /* 0x12C : mjpeg_q_mode_b */
    union {
        struct
        {
            uint32_t frame_q_mode_b : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode_b;

    /* 0x130 : mjpeg_q_mode_c */
    union {
        struct
        {
            uint32_t frame_q_mode_c : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode_c;

    /* 0x134 : mjpeg_q_mode_d */
    union {
        struct
        {
            uint32_t frame_q_mode_d : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode_d;

    /* 0x138 : mjpeg_q_mode_e */
    union {
        struct
        {
            uint32_t frame_q_mode_e : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode_e;

    /* 0x13C : mjpeg_q_mode_f */
    union {
        struct
        {
            uint32_t frame_q_mode_f : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_mode_f;

    /* 0x140  reserved */
    uint8_t RESERVED0x140[176];

    /* 0x1F0 : mjpeg_debug */
    union {
        struct
        {
            uint32_t reg_mjpeg_dbg_en  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3      : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t reg_mjpeg_dbg_sel : 4;  /* [ 7: 4],        r/w,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_debug;

    /* 0x1f4  reserved */
    uint8_t RESERVED0x1f4[8];

    /* 0x1FC : mjpeg_dummy_reg */
    union {
        struct
        {
            uint32_t mjpeg_dummy_reg : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_dummy_reg;
};

typedef volatile struct mjpeg_reg mjpeg_reg_t;

#endif /* __MJPEG_REG_H__ */
